# Features of PANDAS Library:
- Powerful Python library primarily used for data manipulation and analysis.
- Provides functions to handle missing data, duplicates, and data normalization, making it easier to clean and preprocess data.
- Supports various file formats like CSV, Excel, SQL databases, JSON, and more for easy data import and export.
- Offers tools for reshaping data, pivoting tables, and creating new data structures from existing ones.
- Efficient for handling large datasets due to its optimized performance, leveraging the speed of NumPy.
- And many more!

In [1]:
import pandas as pd

In [2]:
my_arr = [1,2,3]
label = ['a','b','c']
dict={1:'a',2:'b',3:'c'}
pd.Series(dict)

1    a
2    b
3    c
dtype: object

In [3]:
pd.Series(data = my_arr, index = label)
#or
#pd.Series(my_arr,label)

a    1
b    2
c    3
dtype: int64

In [4]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [5]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [6]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [7]:
ser3 = pd.Series(data=label)
ser3

0    a
1    b
2    c
dtype: object

In [8]:
ser3[0]

'a'

In [9]:
ser1 + ser2
#int are converted to float

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [10]:
ser1['USA']

1

# Pandas - DataFrames

In [11]:
import numpy as np

In [12]:
from numpy.random import randn

In [13]:
np.random.seed(101)
#get same random numbers

In [14]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
#DataFrame(no_rows, no_col, row_label, col_label)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
type(df['W'])

pandas.core.series.Series

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [19]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [20]:
df.drop('new',axis = 1)
#axis=0 is for rows
#axis=1 is for cols

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [22]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177

In [23]:
df.shape

(5, 5)

In [24]:
df.loc['A']
#label based index

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.334983
Name: A, dtype: float64

In [25]:
df.iloc[2]
#numerical based index

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -1.278046
Name: C, dtype: float64

In [26]:
df.loc['B','Y']

-0.8480769834036315

In [27]:
df.iloc[1,2]

-0.8480769834036315

In [28]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [29]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [30]:
dff = df.drop('new',axis=1)
dff

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
dff>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [32]:
booldf = dff>0
dff[booldf]
#or
#dff[dff>0]
#represents true values

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
dff[dff['W']>0]
#shows rows with W values>0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
rdf = dff[dff['W']>0]
rdf['X']
#or
#dff[dff['W']>0]['X']
#dff[dff['W']>0][['X','Y']]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [35]:
dff[dff['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [36]:
dff

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
dff[(dff['W']>0) & (dff['Y']>0)]
#use & instead of and

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [38]:
True and False

False

In [39]:
True and True

True

In [40]:
dff.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [41]:
new='A B C D E'.split()
new
#or
#'A B C D E F'.split()

['A', 'B', 'C', 'D', 'E']

In [42]:
dff['Alpha']=new
dff

          W         X         Y         Z Alpha
A  2.706850  0.628133  0.907969  0.503826     A
B  0.651118 -0.319318 -0.848077  0.605965     B
C -2.018168  0.740122  0.528813 -0.589001     C
D  0.188695 -0.758872 -0.933237  0.955057     D
E  0.190794  1.978757  2.605967  0.683509     E

In [43]:
dff.set_index('Alpha')
#sets cols as index

              W         X         Y         Z
Alpha
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
C     -2.018168  0.740122  0.528813 -0.589001
D      0.188695 -0.758872 -0.933237  0.955057
E      0.190794  1.978757  2.605967  0.683509

In [44]:
#index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))    
#makes inside outside pairs (('G1',1),('G2',2))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [45]:
df = pd. DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [46]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [47]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [48]:
df.index.names
#shows index name of G1 col and 123 col

FrozenList([None, None])

In [49]:
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [50]:
df.index.names

FrozenList(['Groups', 'Num'])

In [51]:
df.loc['G2'].loc[2][1]
#or
#df.loc['G2'].loc[2]['B']

0.07295967531703869

In [52]:
#xs= cross-section
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [53]:
#shows entry 1 of 'Num' from all groups
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [54]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [55]:
df.dropna()
#drop rows of missing values
#default axis=0

     A    B  C
0  1.0  5.0  1

In [56]:
df.dropna(axis=1)
#drop cols of null values

   C
0  1
1  2
2  3

In [57]:
df.dropna(thresh=2)
#allows atleast 2 values along with missing values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [58]:
df.fillna(value='FILLVALUE')

           A          B  C
0        1.0        5.0  1
1        2.0  FILLVALUE  2
2  FILLVALUE  FILLVALUE  3

In [59]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [60]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [61]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [62]:
bycomp = df.groupby('Company')
bycomp

In [63]:
bycomp.sum()
#other methods
#bycomp.std() -> std. devi.

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [64]:
bycomp.sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [65]:
df.groupby('Company').sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [66]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [67]:
df.groupby('Company').min()
#shows min sales of each company from data

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [69]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [70]:
df.groupby('Company').describe().transpose()
#.transpose change table format

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [71]:
df.groupby('Company').describe().transpose()['FB']
#shows info of particular group

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# Merge, Join, Concatenate

In [72]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                   'B' : ['B0','B1','B2','B3'],
                   'C' : ['C0','C1','C2','C3'],
                   'D' : ['D0','D1','D2','D3']},
                  index=[0,1,2,3])

In [73]:
df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
                   'B' : ['B4','B5','B6','B7'],
                   'C' : ['C4','C5','C6','C7'],
                   'D' : ['D4','D5','D6','D7']},
                  index=[4,5,6,7])

In [74]:
df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                   'B' : ['B8','B9','B10','B11'],
                   'C' : ['C8','C9','C10','C11'],
                   'D' : ['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [75]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [76]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [77]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [78]:
pd.concat([df1,df2,df3])
#here axis=0

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [79]:
pd.concat([df1,df2,df3],axis=1)
#adds horizontally with resp. indexes

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [80]:
left = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3'],
                    'key':['K0','K1','K2','K3']},
                   index=[0,1,2,3])
right = pd.DataFrame({'C': ['C0','C1','C2','C3'],
                     'D' : ['D0','D1','D2','D3'],
                     'key':['K0','K1','K2','K3']},
                    index=[0,1,2,3])

In [81]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [82]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [83]:
left.merge(right)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [84]:
pd.merge(left,right,how='inner',on='key')
#on= common parameter

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [85]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                     'key2':['K0','K1','K0','K1'],
                    'A': ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3']})

right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                     'key2':['K0','K0','K0','K0'],
                    'C': ['C0','C1','C2','C3'],
                     'D' : ['D0','D1','D2','D3']})

In [86]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [87]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [88]:
pd.merge(left,right,on=['key1','key2'])
#merges values of equal keys regardless index
#A2B2=K1K2=C1D1

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [89]:
pd.merge(left,right,how='outer',on=['key1','key2'])
#shows total pairs and values

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [90]:
pd.merge(left,right,how='left',on=['key1','key2'])
#shows pairs of left with filled values
#use how=right for table of right

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [91]:
left = pd.DataFrame({'A': ['A0','A1','A2'],
                    'B' : ['B0','B1','B2']},
                    index=['K0','K1','K2'])

right = pd.DataFrame({'C': ['C0','C1','C2'],
                    'D' : ['D0','D1','D2']},
                    index=['K0','K2','K3'])

In [92]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [93]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [94]:
left.join(right)
#joins right with index of left
#right's index are not considered

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [95]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C1  D1   A2   B2
K3  C2  D2  NaN  NaN

In [96]:
left.join(right,how='outer')
#joins values of every index

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

# Operations

In [97]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [98]:
df['col2'].unique()
#shows all unique values

array([444, 555, 666], dtype=int64)

In [99]:
df['col2'].nunique()
#no. of unique

3

In [100]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [101]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [102]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [103]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [104]:
def times2(x):
    return x*2

In [105]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [106]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [107]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [108]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [109]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [110]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [111]:
df.sort_values('col2')
#or df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [112]:
df.isnull()
#shows if null value is there or no

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [113]:
df = pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
                  'B':['one','one','two','two','one','one'],
                  'C':['x','y','x','y','x','y'],
                  'D':[1,3,2,5,4,1]})
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [114]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data input and output

In [115]:
pwd

'C:\\Users\\morad\\DS'

In [116]:
#READ & CONVERT TO CSV FILE
#pd.read_csv('example.csv')
#df.to_csv('My_output',index=False)

In [117]:
#READ & CONVERT TO EXCEL FILE
#pd.read_excel('Excel_sample.xlsx',sheetname='Sheet1')
#df.to_excel('Excel_smaple2.xlsx',sheet_name='NewSheet')

In [118]:
#READ & CONVERT TO HTML FILE
# data = pd.read_html('https://www.....html')
#type(data)   -----> list
#data[0].head()

In [119]:
from sqlalchemy import create_engine

In [120]:
engine = create_engine('sqlite:///:memory:')
#created sqllite engine running in memory

In [121]:
#READ & CONVERT TO SQL FILE
df.to_sql('my_table',engine)

6

In [122]:
sqldf = pd.read_sql('my_table',con=engine)
sqldf

   index    A    B  C  D
0      0  foo  one  x  1
1      1  foo  one  y  3
2      2  foo  two  x  2
3      3  bar  two  y  5
4      4  bar  one  x  4
5      5  bar  one  y  1